Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_UsingSwiftWithCocoaAndObjective-C/Swift_BCA-level2.tmx
Source language: en_us
Languages: ja

source: An Objective-C method reference can be parenthesized, and it can use the as operator to disambiguate between overloaded functions, such as #selector(((UIView.insert(subview:at:)) as (UIView) -> (UIView, Int) -> Void)).
ja: Objective-Cメソッド参照は、丸括弧で括られることができます、そしてそれはオーバーロードされた関数間を明確にするためにas演算子を使うことができます、例えば#selector(((UIView.insert(subview:at:)) as (UIView) -> (UIView, Int) -> Void))のように。

source: An empty option set can be created from an empty array literal ([]) or by calling its default initializer.
ja: 空のオプションセットは、空の配列リテラル（[]）から、またはそれの省略時のイニシャライザを呼ぶことによって作成されることができます。

source: An in-out expression of type Type that contains a mutable variable, property, or subscript reference, which is passed as a pointer to the address of the mutable value.
ja: １つの可変の変数、プロパティ、または添え字参照を含んでいる、型Typeの１つのin-out式、それは、ボインタとしてその可変値のアドレスへと渡されます。

source: An in-out expression of type [Type] that contains a mutable variable, property, or subscript reference, which is passed as a pointer to the start of the array, and is lifetime-extended for the duration of the call
ja: 可変の変数、プロパティ、または添え字参照を含んでいる、型[Type]のin-out式、それは、ポインタとしてその配列の始まりへと渡されます、そして呼び出しの持続期間は寿命延長されます

source: An in-out expression that contains a mutable variable, property, or subscript reference of type Type, which is copied bitwise into a temporary nonowning buffer.
ja: ひとつのin-out式で、それが型Typeの可変の変数、プロパティ、または添え字参照を含むもの、それは一時的な非所有バッファにビット単位でコピーされるものです。

source: An in-out expression that contains a mutable variable, property, or subscript reference of type Type, which is passed as a pointer to the address of the left-hand side identifier.
ja: ひとつのin-out式で、それが型Typeの可変の変数、プロパティ、または添え字参照を含むもの、それは左手側識別子のアドレスへのポインタとして渡されます。

source: An undo operation records the steps necessary to counteract its corresponding operation, such as setting the text of a control back to its original value or adding a deleted item back into a table.
ja: ある取り消し操作は、それの対応している操作を無効にするために必要な段取りを記録します、例えばあるコントロールのテキストをそれのオリジナルの値に戻すよう設定する、または削除した項目を表に戻すよう加えるなど。

source: And here’s how Swift imports it:
ja: そしてここにスウィフトがそれをインポートする方法があります：

source: And here’s how you add the same availability information in Objective-C:
ja: そしてここにあなたが同じ利用可能性情報をObjective-Cにおいて加える方法があります：

source: And here’s how you use the same availability information in Objective-C:
ja: そしてここにはあなたが同じ利用可能性情報をObjective-Cで使う方法があります：

source: And here’s the equivalent code in Swift:
ja: そしてここにスウィフトにおける同等のコードがあります：

source: And here’s what it looks like in Swift:
ja: そして、それがスウィフトではどんなものになるかがここにあります：

source: Any Objective-C framework or C library that supports modules can be imported directly into Swift.
ja: モジュールをサポートするどんなObjective-CフレームワークまたはCライブラリでも、スウィフトに直接インポートされることができます。

source: Any command-line arguments that are specified at launch begin at CommandLine.arguments[1].
ja: 起動時に指定される何らかのコマンドライン引数は、CommandLine.arguments[1]で始まります。

source: Any exception handling behavior must be implemented in Objective-C code used by Swift.
ja: どのような例外処理挙動もスウィフトによって使用されるObjective-Cコードの中で実装されなければなりません。

source: Any language framework
ja: 何らかの言語フレームワーク

source: Any optional protocol requirements must be marked with the @objc attribute and have the optional modifier.
ja: なんであれオプショナルのプロトコル要件は、@objc属性で印されてoptional修飾子を持たなければなりません。

source: Any public Objective-C headers listed in this bridging header file will be visible to Swift.
ja: この橋渡しヘッダ・ファイルにリストされるどんなパブリックObjective-Cヘッダでも、スウィフトに見えるようになります。

source: Anywhere you can use a bridged Objective-C reference type, you can use the Swift value type instead.
ja: あなたがブリッジObjective-C参照型を使うことができるどこにでも、あなたはスウィフト値型をその代わりに使うことができます。

source: Applying a key path to an instance results in a value of the same type as accessing that instance’s property directly.
ja: キーパス式をインスタンスに適用することは、そのインスタンスの持つプロパティに直接にアクセスするのと同じ型の値という結果になります。

source: Applying the @objMembers attribute to a class implicitly adds the @objc attribute to all of its Objective-C compatible members.
ja: @objMembers属性をあるクラスに適用することは、それのObjective-C互換メンバの全てに暗黙的に@objc属性を加えます。

source: Arrays
ja: 配列

source: As You Work
ja: あなたが作業するとき

source: As a result, changing the value of any computed property on an instance of the imported structure changes the value of all other properties defined by that structure.
ja: 結果として、インポートされた構造体のインスタンス上で何らかの計算プロパティを変更することは、その構造体によって定義される他のプロパティすべての値を変更します。

source: As a result, this attribute can also be useful when migrating an archivable Objective-C class to Swift.
ja: その結果、この属性はまた、アーカイブできるObjective-Cクラスをスウィフトに移行するとき便利でありえます。

source: As a result, you can use an Objective-C structure from Swift in Cocoa APIs that accept only instances of reference types.
ja: 結果として、あなたは参照型のインスタンスのみを受け取るCocoa APIにおいてスウィフト由来のObjective-C構造体を使うことができます。

source: As in Objective-C, you can use outlets, actions, and live rendering in Swift.
ja: Objective-Cの場合のように、あなたはスウィフトにおいてアウトレット、アクション、そしてライブレンダリングを使うことができます。

source: As part of its interoperability with Objective-C, Swift maintains compatibility with a number of C language types and features.
ja: そのObjective-Cとの相互運用性の一部として、スウィフトはたくさんのC言語型と特徴との互換性を維持します。

source: As part of its interoperability with Objective-C, Swift offers convenient and efficient ways of working with Cocoa frameworks.
ja: それのObjective-Cとの相互運用性の一部として、スウィフトはCocoaフレームワークを扱う便利で効率的な方法を提供します。

source: As you begin to integrate Swift into your app development workflow, it’s a good idea to understand how you can leverage interoperability to redefine, improve, and enhance the way you write Cocoa apps.
ja: あなたがスウィフトをあなたのアプリ開発ワークフローに組み込み始めるとき、あなたがあなたがココア・アプリを書く方法をとらえ直して、向上させて、強化するために、どのように相互運用性を使って小さな労力で大きな成果を得られるようにできるか理解することは良い考えです。

source: As you incorporate Cocoa patterns into your Swift class, see Adopting Cocoa Design Patterns for information on translating common design patterns.
ja: あなたがココアパターンをあなたのスウィフトクラスに組み込むとき、ココア・デザインパターンの採用を一般的なデザイン・パターンを翻訳することに関する情報のために見てください。

source: As you work with Objective-C APIs, you’ll need to know how Swift translates certain Objective-C language features.
ja: あなたがObjective-C APIを扱うとき、あなたはスウィフトがどのように特定のObjective-C言語機能を翻訳するか知っている必要があります。

source: At compile time and runtime, the compiler introduces a universal bridging conversion operation when a Swift value or object is passed into Objective-C as an id parameter.
ja: コンパイル時および実行時に、コンパイラは全般的ブリッジ変換演算を、スウィフトの値やオブジェクトがObjective-Cへidパラメータとして渡される時に導入します。

source: Atomicity property attributes (atomic and nonatomic) are not reflected in the corresponding Swift property declaration, but the atomicity guarantees of the Objective-C implementation still hold when the imported property is accessed from Swift.
ja: 原子性プロパティ属性（atomicとnonatomic）は、スウィフトプロパティ宣言に反映されません、しかしObjective-C実装の原子性担保はインポートされたプロパティがスウィフトからアクセスされる時に依然として保持されます。

source: Attempting to call the +collectionWithValues:forKeys: method from Swift code will result in a compiler error.
ja: +collectionWithValues:forKeys:メソッドをスウィフトコードから呼び出す試みは、コンパイラエラーの結果になるでしょう。

source: Attempting to invoke a method on an object with an unrecognized selector causes the receiver to call doesNotRecognizeSelector(_:), which by default raises an NSInvalidArgumentException exception.
ja: メソッドをオブジェクト上で十分に評価されていないセレクタで発動することは、そのレシーバがdoesNotRecognizeSelector(_:)を呼び出す原因になります、それは初期設定ではNSInvalidArgumentException例外を引き起こします。

source: Autorelease Pools
ja: オートリリースプール

source: Autorelease pool blocks allow objects to relinquish ownership without being deallocated immediately.
ja: オートリリースプール・ブロックは、オブジェクトに直ちにデアロケートされることなしに所有権を放棄させます。

source: Autoreleasing Pointers
ja: 自動解放ポインター

source: Availability checks can be used in place of a condition in a control flow statement, such as an if, guard, or while statement.
ja: 有効性確認は、制御の流れ文、例えばif、guard、またはwhileの中のひとつの条件の代わりに使われることができます。

source: Avoiding Strong Reference Cycles When Capturing self
ja: 強い参照循環を自身をキャプチャするときに避ける

source: Basic Setup
ja: 基本の準備

source: Because NSNumber can contain a variety of different types, you must use the as? operator when casting to a Swift number type.
ja: NSNumberが様々な異なる型を含むことができることから、あなたはスウィフト数値型をキャストする時にas?演算子を使わなければなりません。

source: Because a lazy property is only computed when accessed for a fully-initialized instance it may access constant or variable properties in its default value initialization expression:
ja: 遅延プロパティは、完全に初期化されたインスタンスに対してアクセスされる時に初めて計算されるので、それは、定数または変数プロパティにアクセスすることがそれの省略時の値の初期化式において可能です：

source: Because applying the @objc attribute can increase the compiled size of an app and adversely affect performance, only apply the @objcMembers attribute on declarations when each member needs to have the @objc attribute applied.
ja: @objc属性を適用することはアプリのコンパイル済みサイズを増大させて性能に不利な影響をもたらすことから、各メンバが@objc属性を適用される必要がある場合に、ただ@objcMembers属性を宣言上でだけ適用してください。

source: Because archived objects store the name of their class in the archive, you should use the @objc(name) attribute to specify the same name as your Objective-C class so that older archives can be unarchived by your new Swift class.
ja: アーカイブされたオブジェクトがそれらのクラスの名前をアーカイブに格納するので、あなたは@objc(name)属性を使ってあなたのObjective-Cクラスと同じ名前を指定しなければなりません、それでちょっと古くなったアーカイブがあなたの新しいスウィフトクラスによってアンアーカイブされることができます。

source: Because of Swift’s interoperability with Objective-C, you can take advantage of these common patterns in your Swift code.
ja: スウィフトのObjective-Cとの相互運用性のため、あなたはこれらの共通のパターンをあなたのスウィフトコードにおいて活用することができます。

source: Because simple constant-like macros map directly to Swift global variables, the compiler automatically imports simple macros defined in C and Objective-C source files.
ja: 単純な定数的なマクロがスウィフトのグローバル変数に直接にマップするので、コンパイラは、CとObjective-Cソース・ファイルにおいて定義される単純なマクロを自動的にインポートします。

source: Because the Cake structure has fields with unnamed types, you use the .init initializers, which are picked using type inference, to set the initial value for each of the structure’s unnamed fields.
ja: Cake構造体は無名型でのフィールドを持つことから、あなたは.initイニシャライザを使うことによって、それは型推論を使って選択されます、その構造体の持つ無名フィールドの各々に対して初期値を設定します。

source: Because the first field of the Cake structure is unnamed, its initializer’s first parameter does not have a label.
ja: Cake構造体の最初のフィールドが無名であるため、それのイニシャライザの最初のパラメータはラベルを持ちません。

source: Because the generated header for a framework target is part of the framework’s public interface, only declarations marked with the public or open modifier appear in the generated header for a framework target.
ja: あるフレームワークターゲットのために生成されたヘッダはそのフレームワークのパブリックなインターフェイスの一部なので、publicまたはopen修飾子で印された宣言だけがフレームワークターゲットのために生成されたヘッダの中に現れます。

source: Because the namespace of classes and protocols is unified in Swift, the NSObject protocol in Objective-C is remapped to NSObjectProtocol in Swift.
ja: クラスとプロトコルの名前空間はスウィフトにおいて統一されるので、Objective-CのNSObjectプロトコルはスウィフトにおいてNSObjectProtocolにリマップされます。

source: Because the specific type of an AnyObject value is not known until runtime, it is possible to inadvertently write unsafe code.
ja: AnyObject値の具体的な型は実行時まで知られないことから、不注意に安全でないコードを書くことは可能です。

source: Because the type of the valueFromSwift parameter is id, it’s imported in the Swift code below as the Swift type Any.
ja: valueFromSwiftパラメータの型はidであるので、それは以下のスウィフトコードにおいてスウィフト型Anyとしてインポートされます。

source: Because this functionality is provided through language features, the corresponding POSIX and Grand Central Dispatch C function calls are not exposed by Swift.
ja: この機能性は言語特徴によって提供されるので、相当するPOSIXおよびGrand Central DispatchのC関数呼び出しはスウィフトによって暴露されません。

source: Because unions in C use the same base memory address for all of their fields, all of the computed properties in a union imported by Swift use the same underlying memory.
ja: Cでの共用体は同じ基盤メモリアドレスをすべてのそれのフィールドに対して使うことから、スウィフトによってインポートされる共用体の中の計算プロパティのすべては同じ基礎をなすメモリを使います。

source: Because you can’t subclass Swift classes in Objective-C, it’s best to choose a class in your app that doesn’t have any subclasses.
ja: あなたがスウィフトクラスをObjective-Cにおいてサブクラス化できないので、あなたのアプリにおいて全くサブクラスを持たないクラスを選択するのは最も良いことです。

source: Before You Start
ja: あなたが始める前に

source: Before you begin migrating your codebase, make sure that your Objective-C and Swift code has optimal compatibility.
ja: あなたがあなたのコードベースを移行し始める前に、あなたのObjective-Cとスウィフトコードが最適の互換性を持つことを確かにしてください。

source: Before you get started learning about these features, you need a basic understanding of how to set up a Swift environment in which you can access Cocoa system frameworks.
ja: あなたがこれらの特徴について学ぶことを始める前に、あなたは、そこにおいてあなたがココア・システム・フレームワークにアクセスすることができるところの、スウィフト環境を設定する方法の基本的な理解が必要です。

source: Bit Fields
ja: ビットフィールド

source: Blocks maintain strong references to any captured objects, including self.
ja: ブロックは、selfを含めて、あらゆるキャプチャされるオブジェクトに対する強い参照を管理します。

source: Both kinds of availability specifier are available in Objective-C using the corresponding syntax shown in the following examples.
ja: 両方の種類の利用可能性指定子は、以下の例で示される対応する構文を使ってObjective-Cで利用可能です。

source: Both of these methods return the original, unwrapped type of the object.
ja: これらのメソッドの両方とも、最初の、包装を取られた型のオブジェクトを返します。

source: Bridged Types
ja: ブリッジ型

source: Bridging Optionals to Nonnullable Objects
ja: オプショナルをnull不可オブジェクトへブリッジする

source: Buffer Pointers
ja: バッファポインタ

source: By casting to ToDoListController, this return value can make the corresponding call to mark(task:asCompleted:) directly.
ja: ToDoListControllerにキャストすることによって、この戻り値は直接にmark(task:asCompleted:)に対する対応する呼び出しを作ることができます。

source: By default, Swift imports enumerations by truncating enumeration value name prefixes.
ja: 特に何もしなくとも、スウィフトは列挙値名接頭辞を切り取ることによってを列挙インポートします。

source: By default, the generated header contains interfaces for Swift declarations marked with the public or open modifier.
ja: 特に何もしなければ、生成されたヘッダはスウィフト宣言をpublicまたはopen修飾子で印して含みます。

source: By default, your product module name is the same as your product name.
ja: 特に何もしなければ、あなたの製品モジュール名は、あなたの製品名と同じものです。

source: C struct and union types can define fields that have no name or that are of an unnamed type.
ja: Cのstructおよびunion型は、名前を持たないまたは無名型であるフィールドを定義できます。

source: C APIs, such as the Core Foundation framework, often provide functions that create, access, or modify C structures.
ja: C API、例えばCore Foundationフレームワークは、C構造体の作成、アクセス、または修正をする関数をしばしば提供します。

source: C Syntax
ja: C構文

source: C Type
ja: C型

source: C enumerations imported by Swift do not fail when initializing with a raw value that does not correspond to an enumeration case.
ja: スウィフトによってインポートされるC列挙は、ある生の値が列挙ケース節と調和しない状態での初期化の時に失敗しません。

source: C function pointers are imported into Swift as closures with C function pointer calling convention, denoted by the @convention(c) attribute.
ja: C関数ポインターは、スウィフトにC関数呼出規約を持つクロージャとしてインポートされ、@convention(c)属性によって印を付けられます。

source: Catching and Handling Custom Errors
ja: カスタムエラーを捕まえて処理する

source: Catching and Handling an Error
ja: エラーを捕えて処理する

source: Changed code listings to use the new Array and Dictionary type syntax.
ja: コード出力を変更して新しいArrayとDictionary型構文を使うようにした。

source: Check that myDelegate implements the method window:willUseFullScreenContentSize:.
ja: myDelegateがメソッドwindow:willUseFullScreenContentSize:を実装することを確かめる。

source: Check that myDelegate is not nil.
ja: myDelegateがnilでないことを確かめる。

source: Checking for and casting to a protocol follows exactly the same syntax as checking for and casting to a class.
ja: あるプロトコルに対する調査とキャストは、あるクラスに対する調査とキャストと正確に同じ構文に従います。

source: Choose File > New > Project > (iOS, watchOS, tvOS, or macOS) > Application > your template of choice.
ja: 「ファイル」>「新規」>「プロジェクト」>（iOS、watchOS、tvOS、またはmacOS）>「アプリケーション」>あなたの選ぶひな形を選んでください。

source: Choose “Create NSManagedObject Subclass…” from the “Editor” menu to generate corresponding Swift code for the NSManagedObject subclass, Person:
ja: 「Create NSManagedObject Subclass…」を「Editor」メニューから選択することで、NSManagedObjectのサブクラス、Personに対応するスウィフトコードを生成してください：

source: Clarified the behavior of Objective-C atomicity attributes in Swift in the Accessing Properties section.
ja: スウィフトにおけるObjective-C原子性属性の挙動をプロパティにアクセスする節においてわかりやすくした。

source: Clarified the behavior of the AnyObject protocol in the id Compatibility section.
ja: AnyObjectプロトコルの挙動をid互換性節においてわかりやすくした。

source: Class Factory Methods
ja: クラスファクトリメソッド

source: Class Factory Methods and Convenience Initializers
ja: クラスファクトリメソッドと便宜イニシャライザ

source: Class clusters that include immutable and mutable subclasses are bridged to a single value type.
ja: 不変および可変サブクラスを含むクラス群は、単一値型へブリッジされます。

source: Class prefixes are optional in Swift.
ja: クラス接頭辞は、スウィフトでは随意です。

source: Classes specific to Objective-C or inherently tied to the Objective-C runtime, such as NSObject, NSAutoreleasePool, NSException, and NSProxy
ja: Objective-C特有の、またはObjective-Cランタイムに本質的に結びつけられ切り離せないクラス、例えばNSObject、NSAutoreleasePool、NSException、そしてNSProxyなど。

source: Classes that adopt NSCoding directly must implement this method.
ja: 直接にNSCodingを採用するクラスは、このメソッドを実装しなければなりません。

source: Classes that do not have a value type equivalent but are planned to have one in the near future, such as NSAttributedString, NSRegularExpression, and NSPredicate
ja: 値型の相当物を持たないが近い将来それを持つ計画をされるクラス、例えばNSAttributedString、NSRegularExpression、そしてNSPredicate

source: Classes that have a value type equivalent, as described in Bridged Types, such as NSString, NSDictionary, and NSURL
ja: ブリッジ型で記述される、値型の相当物を持つクラス、例えばNSString、NSDictionary、そしてNSURLなど。

source: Click the Language pop-up menu and choose Swift.
ja: 「言語」ポップアップ・メニューをクリックして、スウィフトを選んでください。

source: Closures
ja: クロージャ

source: Closures have similar capture semantics as blocks but differ in one key way: Variables are mutable rather than copied.
ja: クロージャは、ブロックとしての類似したキャプチャ意味論を持ちますが、１つの重要なやり方において異なります：変数は、コピーされるのではなく、可変です。

source: Cocoa Structures
ja: Cocoa構造体

source: Command-click a Swift class name to see its generated header.
ja: スウィフトクラス名をコマンド-クリックして、その生成ヘッダを見てください。

source: Complex Macros
ja: 複雑なマクロ

source: Complex macros are macros that do not define constants, including parenthesized, function-like macros.
ja: 複雑なマクロは、定数を定義するものではなく、括弧に入れられた、関数のようなマクロのことです。

source: Complex macros are used in C and Objective-C but have no counterpart in Swift.
ja: 複雑なマクロがCとObjective-Cで使われますが、スウィフトにおいて対応するものがありません。

source: Conditional Compilation Blocks
ja: 条件コンパイルブロック

source: Configuring Swift Interfaces in Objective-C
ja: スウィフトインターフェイスをObjective-Cにおいて構成する

source: Consider the following Objective-C initializer declarations:
ja: 以下のObjective-Cイニシャライザ宣言を考えてみてください：

source: Constant Pointers
ja: 定数ポインター

source: Constants imported from a type declaration marked with the NS_TYPED_EXTENSIBLE_ENUM macro can be extended in Swift code to add new values.
ja: NS_TYPED_EXTENSIBLE_ENUMマクロで印される型宣言からインポートされる定数は、スウィフトコードにおいて拡張されて新しい値を加えられることが可能です。

source: Constants that represent a fixed set of possible values can be imported as a structure by adding the NS_TYPED_ENUM macro.
ja: ある固定された一揃いの候補の値を表す定数いくらかは、構造体としてインポートされることがNS_TYPED_ENUMマクロを加えることによって可能です。

source: Constants that represent an extensible set of possible values can be imported as a structure by adding the NS_TYPED_EXTENSIBLE_ENUM macro.
ja: ある拡張可能な一揃いの候補の値を表す定数いくらかは、NS_TYPED_EXTENSIBLE_ENUMマクロを加えることによって構造体としてインポートされることができます。

source: Constants using this extensible form are imported with an additional initializer that lets callers omit the argument label when extending the set with new values.
ja: この拡張可能な形式を使う定数は、追加的なイニシャライザ、新しい値を持つ集合を拡張する時に呼出し側に引数ラベルを省略させるもの、でインポートされます。

source: Conversely, Swift also provides the @nonobjc attribute, which makes a Swift declaration unavailable in Objective-C.
ja: 逆に、スウィフトはまた@nonobjc属性も提供します、それはあるスウィフト宣言をObjective-Cにおいて利用不可能にします。

source: Converting Errors to Optional Values
ja: エラーをオプショナルの値に変換する

source: Copy Semantics
ja: コピー意味論

source: Core Data also provides the implementation of instance methods that you use to add and remove objects from to-many relationships.
ja: コアデータはまた、あなたが対多リレーションシップからのオブジェクトの追加と削除をするために使うインスタンスメソッドの実装を提供します。

source: Core Data provides the underlying storage and implementation of properties in subclasses of the NSManagedObject class.
ja: コアデータは、プロパティたちの基盤となる外部記憶と実装をNSManagedObjectクラスのサブクラスにおいて提供します。

source: Core Foundation
ja: コアファウンデーション

source: Core Foundation objects returned from annotated APIs are automatically memory managed in Swift—you do not need to invoke the CFRetain, CFRelease, or CFAutorelease functions yourself.
ja: 注釈をつけられたAPIから返されるコアファウンデーション・オブジェクトは、自動的にスウィフトにおいてメモリ管理されます ― あなたは、あなた自身でCFRetain、CFRelease、またはCFAutorelease関数を呼び出す必要はありません。

source: Core Foundation types are imported as Swift classes.
ja: コアファウンデーション型は、スウィフトクラスとしてインポートされます。

source: Corrected the Live Rendering section which previously stated that live rendering only worked when a designable class was compiled in a framework.
ja: 節ライブレンダリングを訂正した、それは以前はライブレンダリングはただdesignableクラスがフレームワークにおいてコンパイルされた場合にのみ働くと述べていた。

source: Create a Swift class for your corresponding Objective-C .m and .h files by choosing File > New > File > (iOS, watchOS, tvOS, or macOS) > Source > Swift File.
ja: スウィフトクラスをあなたの対応するObjective-Cの.mと.hファイルのために、File > New > File >（iOS、watchOS、tvOS、またはmacOS）> Source > Swift Fileを選ぶことによって作成してください。

source: Create an observer for the key path and call the observe(_:options:changeHandler) method.
ja: キーパスに対する監視を作成してobserve(_:options:changeHandler)メソッドを呼び出してください。

source: Curried functions
ja: カリー化関数

source: Data Type Size Calculation
ja: データ型サイズ計算

source: Declarations marked with the dynamic modifier must also be explicitly marked with the @objc attribute unless the @objc attribute is implicitly added by the declaration’s context.
ja: dynamic修飾子で印される宣言はまた、明示的に@objc属性で印されなければなりません、@objc属性が暗黙的にその宣言の持つ文脈によって加えられるのでない限り。

source: Declarations marked with the private or fileprivate modifier do not appear in the generated header.
ja: privateまたはfileprivate修飾子で印される宣言は、生成されたヘッダの中に現れることはありません。

source: Declare simple macros as global constants, and translate complex macros into functions.
ja: 単純なマクロをグローバルな定数として宣言してください、そして複雑なマクロを関数へと翻訳してください。

source: Declaring Protocols
ja: プロトコルを宣言する

source: Declaring a Swift Error Type That Can Be Used from Objective-C
ja: Objective-Cから利用されることができるスウィフトエラー型を宣言する

source: Declaring a Swift Protocol That Can Be Adopted by an Objective-C Class
ja: Objective-Cクラスによって採用されることができるスウィフトプロトコルを宣言する

source: Delegation
ja: 委任

source: Denote instance (-) and class (+) methods with func and class func, respectively.
ja: インスタンス（-）およびクラス（+）メソッドであることを、それぞれfuncおよびclass funcで示してください。

source: Dictionaries
ja: 辞書

source: Document Revision History
ja: 文書改訂履歴

source: Don’t delete the .m and .h files immediately; use them to troubleshoot.
ja: .mと.hファイルを直ぐに削除しないでください；それらを不具合対処のために使ってください。

source: Don’t try to persist the pointer and access it after the function has returned.
ja: そのポインタに固執すること、そして関数が帰った後でそれにアクセスすることを試みないでください

source: Downcasting Any
ja: Anyのダウンキャスト

source: Dynamic Method Lookup
ja: 動的メソッド検索

source: Each member of the C enumeration is imported as a global read-only computed property of the structure’s type—not as a member of the Swift structure itself.
ja: C列挙の各メンバーは、その構造体の型のグローバルな読み出し専用の計算プロパティとしてインポートされます ― スウィフト構造体自身のメンバーとしてではなく。

source: Each platform argument consists of one of platform names listed below, followed by corresponding version number.
ja: 各プラットホーム引数は、以下で箇条書きにされるプラットホーム名の１つ、それに続く該当するバージョン番号から成ります。

source: Enumerations
ja: 列挙

source: Enumerations defined in Swift without Int raw value type
ja: Intの生の値型なしでスウィフトにおいて定義される列挙

source: Error Handling
ja: エラーの処理

source: Even though each migration experience is different depending on your existing codebase, there are some general steps and tools to help you troubleshoot your code migration:
ja: たとえそれぞれの移行体験があなたの既存のコードベースに従い異なるものではあっても、あなたのコード移行の問題解決を助けるいくつかの一般的な取るべき段階と手段があります：

source: Everything from your implementation and interface goes directly into this single Swift file.
ja: あなたの実装とインタフェースからのすべては、直接この単一のスウィフトファイルに入ります。

source: Extensions
ja: 拡張

source: Failable Initialization
ja: 失敗できる初期化
